<a href="https://colab.research.google.com/github/Mbavhalelo-tech/Data-Science-Process/blob/main/introduction_to_Working_with_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd
from io import StringIO

csv_data = """
Name,Math,English,Science
Mbavhalelo,85,78,92
Nokubonga,76,82,89
Mandisa,93,88,84
David,65,70,72
Lesego,88,91,95
Frank,74,67,80
Grace,90,85,87
Harry,68,73,75
"""

df = pd.read_csv(StringIO(csv_data))
print("Student Scores Dataset:")
print(df.head())

Student Scores Dataset:
         Name  Math  English  Science
0  Mbavhalelo    85       78       92
1   Nokubonga    76       82       89
2     Mandisa    93       88       84
3       David    65       70       72
4      Lesego    88       91       95

## 2. Calculate the Average Score per Subject

In [3]:
print("Average scores by subject:")
print(df[['Math', 'English', 'Science']].mean())

Average scores by subject:
Math       79.875
English    79.250
Science    84.250
dtype: float64

## 3. Find the Highest Score in Each Subject

In [4]:
print("Highest score in each subject:")
print(df[['Math', 'English', 'Science']].max())

Highest score in each subject:
Math       93
English    91
Science    95
dtype: int64

## 4. Identify the Top-Scoring Student in Each Subject

In [5]:
print("Top-scoring student in each subject:")
for subject in ['Math', 'English', 'Science']:
    top_student = df.loc[df[subject].idxmax()]
    print(f"{subject}: {top_student['Name']} - {top_student[subject]}")

Top-scoring student in each subject:
Math: Mandisa - 93
English: Lesego - 91
Science: Lesego - 95

## 5. Calculate Each Studentâ€™s Total and Average Score

In [6]:
df['Total'] = df[['Math', 'English', 'Science']].sum(axis=1)
df['Average'] = df[['Math', 'English', 'Science']].mean(axis=1)
print(df[['Name', 'Total', 'Average']])

         Name  Total    Average
0  Mbavhalelo    255  85.000000
1   Nokubonga    247  82.333333
2     Mandisa    265  88.333333
3       David    207  69.000000
4      Lesego    274  91.333333
5       Frank    221  73.666667
6       Grace    262  87.333333
7       Harry    216  72.000000